Repository: deenison/WP-Lorem-User-Generator
Catalog: src/languages/lorem-user-generator-*.po
Languages: pt_br

source: Invalid request.
pt_br: Requisição inválida.

source: Invalid "%s" parameter.
pt_br: Parâmetro “%s” inválido.

source: Invalid user role.
pt_br: Função de usuário inválida.

source: Invalid nonce.
pt_br: Nonce inválido.

# %s: parameter name
source: Missing/invalid "%s" parameter.
pt_br: Parâmetro “%s” não encontrado ou inválido.

source: There was some error retrieving the response body.
pt_br: Houve algum erro ao tentar analisar a resposta da requisição.

source: There was some error parsing the response body.
pt_br: Houve algum erro ao processar a resposta da requisição.

source: Lorem User Generator
pt_br: Gerador de Usuários Lorem

source: Lorem User Generator Settings
pt_br: Configurações do Gerador de Usuários Lorem

source: User role that will be pre selected on the results table when generating dummy users data.
pt_br: Função que estará pré-selecionado na tabela de resultados quando gerar usuários.

source: Generating...
pt_br: Gerando…

source: Results will appear here...
pt_br: Os resultados aparecerão aqui…

source: Generate
pt_br: Gerar

# %d: Number of results
source: Results (%d)
pt_br: Resultados (%d)

source: Adding...
pt_br: Adicionando…

source: Undocummented error.
pt_br: Erro não documentado.

source: Hide Advanced Filters
pt_br: Esconder Filtros Avançados

source: Show Advanced Filters
pt_br: Mostrar Filtros Avançados

source: Are you sure?
pt_br: Você tem certeza?

source: Number of users
pt_br: Número de usuários

source: required
pt_br: obrigatório

source: You can generate up to 5000 users per batch.
pt_br: Você gerar até 5000 usuários por requisição.

source: Higher the number, the longer will take to generate your results.
pt_br: Quanto maior for o número, mais tempo levará para gerar os seus resultados.

source: Gender
pt_br: Gênero

source: Both
pt_br: Ambos

source: Male
pt_br: Masculino

source: Female
pt_br: Feminino

source: Specify whether you would like to have only male or only female users generated.
pt_br: Especifique se você gostaria de ter apenas usuários masculinos ou femininos gerados.

source: Seed
pt_br: Semente

source: Seeds can be any string or sequence of characters. They allow you to always generate the same set of users.
pt_br: Sementes podem ser qualquer string ou sequência de caracteres. Elas permitem que você gere o mesmo conjunto de usuários.

source: Nationalities
pt_br: Nacionalidades

source: Specify what nationalities you would like the users set to belongs to.
pt_br: Especifique a(s) nacionalidade(s) do conjunto de usuários.

source: Pick one WordPress User Role to be preselected on all generated users.
pt_br: Pré selecione uma uma Função de Usuário do Wordpress para todos os usuários gerados.

source: Skip users review and add them all automatically
pt_br: Pular revisão de usuários e adicione-os automaticamente

source: Default User Role
pt_br: Função de Usuário Padrão

source: Discard User
pt_br: Descartar Usuário

source: You will not see any of the passwords displayed here again, so write them down or make sure to change them later.
pt_br: Você não verá nenhuma das senhas mostradas aqui novamente, então guarde-as ou não se esqueça de trocá-las depois.

source: Add all selected users
pt_br: Adicionar todos os usuários selecionados

source: Discard all selected users
pt_br: Descartar todos os usuários selecionados
